Repository: RandomModderJDK/HWM
Catalog: lib/l10n/app_*.arb
Languages: de

# homeTitle
source: Manage Homework
de: Hausaufgaben verwalten

# settingsTitle
source: Settings
de: Einstellungen

# settingsGeneral
source: General
de: Allgemein

# settingsThemeModeTitle
source: Change Theme
de: Thema wechseln

# settingsThemeModeDescription
source: Change between dark, light, system mode
de: Wechsle zwischen Dunkel-, Hell-, System-Thema

# settingsSubjectsTitle
source: Subjects overview
de: Fächer verwalten

# settingsSubjectsDescription
source: Delete, insert or edit the suggested subjects
de: Entferne, ergänze oder editiere die vorgeschlagenen Fächer

# subjectsTitle
source: Subjects
de: Fächer verwalten

# deleteSubjectToast
source: Deleted {longName} ({shortName})
de: {longName} ({shortName}) gelöscht

# deleteSubjectToastUndo
source: UNDO
de: Rückgängig

# settingsUntisLoginTitle
source: Login
de: Anmelden

# settingsUntisLoginDescription
source: Login with your untis school account
de: Mit deinem Untis-Schulaccount anmelden

# settingsUntisLoginSchool
source: School
de: Schule

# settingsUntisLoginUsername
source: Username
de: Benutzername

# settingsUntisLoginPassword
source: Password
de: Passwort

# settingsUntisTestLoginTitle
source: Test login
de: Test-Anmeldung

# settingsUntisTestLoginDescription
source: Test, if the credentials are valid and you can log in
de: Teste, ob die Zugangsdaten korrekt sind und du dich einloggen kannst.

# settingsUntisImportTitle
source: Import subjects
de: Fächer importieren

# settingsUntisImportDescription
source: Fetch subjects from Untis
de: Rufe Fächer von WebUntis ab und importiere sie

# settingsUntisImportSuccess
source: Imported untis subjects
de: Fächer von WebUntis importiert

# untisLoginFailure
source: Failed to log in
de: Fehler bei Anmeldung

# untisLoginSuccess
source: Login success
de: Anmeldung erfolgreich

# settingsDiscordRelationsTitle
source: Discord Channel Links Overview
de: Discord-Verbindungen verwalten

# settingsDiscordRelationsDescription
source: Delete, insert or edit the links between discord channel name and corresponding webhook
de: Entferne, ergänze oder editiere die Verbindungen zwischen dem Discord-Kanalnamen und dem zugehörigem Webhook

# settingsDiscordRelationsBotToken
source: Bot Token for message fetching
de: Bot-Token zum Abrufen von Nachrichten

# settingsDiscordRelationsBotTryToken
source: Token is tried...
de: Token wird ausprobiert...

# settingsDiscordRelationsBotTryTokenSuccess
source: Bot logged in
de: Bot ist eingeloggt

# settingsDiscordRelationsBotTryTokenFailure
source: Bot could not login!
de: Bot konnte sich nicht einloggen!

# settingsDiscordRelationsImportTitle
source: Import discord channels
de: Discord-Kanäle importieren

# settingsDiscordRelationsImportDescription
source: Import all homework discord channels, using the channel specified above as the identifier. After this, discord channels can be tied to subjects to fetch homework and (with a specified webhook) send homework.
de: Importiere alle (Hausaufgaben-)Kanäle, welche in der Guilde des Bots sind. Hiernach können Discord-Kanäle zu Fächern zugeordnet werden, um Hausaufgaben von Discord abzurufen und (mit einem spezifiziertem Webhook) abzusenden.

# settingsDiscordRelationsImportSuccess
source: Imported {count} discord channels
de: {count, plural, =1 {Ein Discord-Kanal} other {{count} Discord-Kanäle}} importiert

# settingsDiscordRelationsImportFailure
source: Could not import channels
de: Kanalimport schlug fehl!

# discordRelationsTitle
source: Discord Channel Linkage
de: Discord-Verbindungen

# deleteDiscordRelationToast
source: Deleted {longName} ({shortName})
de: {longName} ({shortName}) entfernt

# deleteDiscordRelationToastUndo
source: UNDO
de: Rückgängig

# datePassed
source: Passed already since {date}{hours, plural, =0{} other{ at {time}}}
de: Vorbei seit dem {date}{hours, plural, =0{} other{ um {time}}}

# dateToday
source: Today {hours, plural, =0{} other{at {time}}}
de: Heute {hours, plural, =0{} other{um {time}}}

# dateTomorrow
source: Till tomorrow{hours, plural, =0{} other{ at {time}}}
de: Bis Morgen{hours, plural, =0{} other{ um {time}}}

# dateThisWeek
source: This {weekday}{hours, plural, =0{} other{ at {time}}}
de: Diesen {weekday}{hours, plural, =0{} other{ um {time}}}

# dateNextWeek
source: {date}{hours, plural, =0{} other{ at {time}}}, next week
de: {date}{hours, plural, =0{} other{ um {time}}}, nächste Woche

# dateAnywhereElse
source: {weekday}, {date}{hours, plural, =0{} other{ at {time}}}
de: {weekday}, {date}{hours, plural, =0{} other{ um {time}}}

# dateTimeFieldLabel
source: Until the
de: Bis zum

# dialogDiscordRelationAddTitle
source: Link new channel
de: Füge eine Discord-Verbindung hinzu

# dialogDiscordRelationAdd
source: Add
de: Hinzufügen

# dialogDiscordRelationAddCancel
source: Cancel
de: Abbrechen

# dialogDiscordRelationEditTitle
source: Edit channel link
de: Bearbeite Verbindung

# dialogDiscordRelationEdit
source: Edit
de: Bearbeiten

# dialogDiscordRelationEditCancel
source: Cancel
de: Abbrechen

# dialogDiscordRelationChannelName
source: Channel name
de: Kanalname

# dialogDiscordRelationChannelNameHint
source: Class12.3
de: Klasse12.3

# dialogDiscordRelationChannelNameValidator
source: Enter a valid channel name!
de: Gib einen gültigen Kanalnamen ein!

# dialogSubjectAddTitle
source: Add subject
de: Fach hinzufügen

# dialogSubjectAdd
source: Add
de: Hinzufügen

# dialogSubjectAddCancel
source: Cancel
de: Abbrechen

# dialogSubjectEditTitle
source: Edit subject
de: Fach bearbeiten

# dialogSubjectEdit
source: Edit
de: Bearbeiten

# dialogSubjectEditCancel
source: Cancel
de: Abbrechen

# dialogSubjectFullName
source: Full name
de: Vollständiger Name

# dialogSubjectFullNameHint
source: Mathematics
de: Mathematik

# dialogSubjectFullNameValidator
source: Enter a valid subject name!
de: Gib einen gültigen Fachnamen ein!

# dialogSubjectShortName
source: Optional short name
de: Optionales Kürzel

# dialogSubjectShortNameHint
source: Ma (useful for untis)
de: Ma (nützlich für Untis)

# dialogSubjectChannelName
source: Name of channel (link)
de: Discord-Verbindung

# dialogSubjectChannelNameHint
source: Select channel link
de: Wähle eine Discord-Verbindung aus

# dialogHWSubject
source: Subject
de: Fach

# dialogHWSubjectValidator
source: Enter or select subject!
de: Wähle oder gib ein gültiges Fach ein!

# dialogHWSubjectUntisFailure
source: Could not fetch period from Untis
de: Konnte das Fach nicht innerhalb der nächsten Zeit finden!

# dialogHWSubjectUntisSuccess
source: Fetched date from Untis!
de: Datum von Untis abgerufen!

# dialogHWContent
source: Content
de: Inhalt

# dialogHWContentHint
source: What did you do last lesson? What could the teacher have been thinking?
de: Was hat habt ihr letztes Mal gemacht? Was dachte der Lehrer, wäre super? Etwas was du niemals machen wirst

# dialogHWContentValidator
source: Enter content!
de: Fülle den Inhalt aus!

# dialogHWAddTitle
source: Add homework
de: Hausaufgabe hinzufügen

# dialogHWAdd
source: Add
de: Hinzufügen

# dialogHWAddCancel
source: Cancel
de: Abbrechen

# dialogHWEditTitle
source: Edit homework
de: Hausaufgabe bearbeiten

# dialogHWEdit
source: Edit
de: Bearbeiten

# dialogHWEditCancel
source: Cancel
de: Abbrechen

# deleteHWToast
source: Deleted {id} ({subject})
de: {id} ({subject}) gelöscht

# deleteHWToastUndo
source: UNDO
de: Rückgängig

# discordHomeworkFetchTitle
source: Fetch messages
de: Nachrichten abrufen

# discordHomeworkFetchSuccess
source: Fetched {fetchs}, which adds {creations} homeworks
de: {fetchs} abgerufen, was {creations, plural, =1 {1 Hausaufgabe} other {{creations} Hausaufgaben}} hinzufügt

# discordHomeworkFetchLocalOverwriteStatus
source: There were {overwrites} local changes, that got overwritten
de: Es gab {overwrites, plural, =1 {eine lokale Änderung} other {{overwrites} lokale Änderungen}}, welche überschrieben worden sind

source: Show more
de: Mehr anzeigen

source: Show less
de: Weniger anzeigen

# discordCreateMessageButton
source: Post new message
de: Discord-Nachricht posten

# discordEditMessageButton
source: Modify existing message
de: Existierende Discord-Nachricht bearbeiten

# discordWebhookTooManyPagesError
source: There were only 10 pages send, as discord does not support more
de: Nur 10 Seiten werden gesendet, weil Discord nicht mehr unterstützt!

# discordWebhookMessageEditNotPossible
source: Original message doesn't exists, sending new...
de: Original-Nachricht existiert nicht mehr, sende Neue...

# discordWebhookURLInvalid
source: The webhook is invalid
de: Der Webhook ist ungültig

# discordNetworkError
source: Network error, whilst requesting discord: {err}
de: Netzwerkfehler, beim Verbinden zu Discord: {err}

# takePhoto
source: Add a photo
de: Ein Foto hinzufügen

# photoOptionCamera
source: Take a photo
de: Schieß ein Foto

# photoOptionGallery
source: Add image from gallery
de: Füge Bild aus Gallerie hinzu

source: Open Image Viewer
de: Seiten ansehen

source: Image Viewer
de: Bildbetrachter

source: Previous page
de: Vorherige Seite

source: Next page
de: Nächste Seite

# pageDisplay
source: Page {current}/{pages}
de: Seite {current}/{pages}

# deletePagesTitle
source: Delete pages
de: Seiten löschen

# deletePages
source: Delete
de: Löschen

# deletePagesCancel
source: Cancel
de: Abbrechen

# deletePagesEntry
source: Page {page}
de: Seite {page}
